<script setup lang="ts">
import { api } from '@/router/axios';
import { onMounted } from 'vue';
import HeaderBar from '../components/HeaderBar.vue';
import Toast from 'primevue/toast';
import { useToast } from 'primevue/usetoast';

const toast = useToast();
onMounted(() => {
  api.get('').then((res) => {
    console.log(res);
    toast.add({
      severity: 'info',
      summary: 'Info Message',
      detail: res.data,
      life: 3000,
    });
  });
});

const casea: {
  // eslint-disable-next-line @typescript-eslint/no-explicit-any
  [key: string]: any;
} = {
  全文: {
    文首: {
      文书制作单位: '法院',
      法院文书种类: '裁判文书',
      经办法院: '浙江省温州市中级人民法院',
      文书名称: '刑事判决书',
      案号: '（2014）浙温刑初字第122号',
      案件类别: '刑事案件',
      文书种类: '判决书',
      审判程序: '一审案件',
      案件类型: '刑事一审案件',
    },
    当事人:
      '公诉机关浙江省温州市人民检察院。 被告人尤仁健。曾因犯盗窃罪、诈骗罪于2003年11月被判处有期徒刑三年；又因犯诈骗罪于2008年1月2日被判处有期徒刑七年，2013年1月4日刑满释放。现因涉嫌犯盗窃罪于2014年2月9日被刑事拘留，2014年3月18日被逮捕。现羁押于温州市鹿城区看守所。 指定辩护人张奕。',
    诉讼记录:
      ' 浙江省温州市人民检察院以温检公诉一处刑诉（2014）1064号起诉书指控被告人尤仁健犯盗窃罪、信用卡诈骗罪，于2014年7月8日向本院提起公诉。本院依法组成合议庭，公开开庭审理了本案。温州市人民检察院指派代理检察员张新欣出庭支持公诉。被告人尤仁健及其指定辩护人张奕到庭参加诉讼。现已审理终结。',
    案件基本情况:
      ' 温州市人民检察院指控，2013年8月，被告人尤仁健，通过王某介绍，认识了在温州市新南亚ktv工作的被害人蒋某，被告人尤仁健化名曹振山，虚构家庭背景，以为被害人蒋某买车为幌子，骗得了被害人蒋某的信任。2013年8月29日8时至9时30分许，被告人尤仁健在温州市上村路13幢308室被害人蒋某的住处盗得蒋62×××75的中国农业银行卡一张，并于当日上午在浙江金万年珠宝有限公司第一分公司温州解放街店购买黄金饰品刷卡消费人民币213213元，在温州市尚晨珠宝有限公司购买黄金饰品刷卡消费人民币3900元，在温州市鹿城区五马街中国工商银行atm机提取人民币18000元。 2013年10月底，被告人尤仁健在浙江省杭州市东方魅力娱乐城结识被害人杜某。被告人尤仁健化名曹振山，虚构家庭背景，以为被害人杜某买车为幌子，骗得了被害人杜某的信任。2013年11月10日晚，被告人尤仁健以没钱请客户吃饭等为借口，骗得被害人杜某的卡号为62×××71的中国银行卡一张，持该卡消费取现共计人民币59026元。后又返回被害人杜某位于浙江省杭州市下城区仙林苑18幢3单元302室的住处，盗取现金人民币33500元及卡号为60×××41的中国邮政储蓄卡一张，又持该卡消费取现共计人民币208284元。 2013年11-12月间，被告人尤仁健窜至江苏省南京市，结识被害人陈某乙。2014年1月3日，被告人尤仁健在江苏省南京市鼓楼区中商万豪4724室盗得受害人陈某乙卡号为62×××17的中国农业银行卡一张和卡号为62×××34的工商银行卡一张，后在胡某经营的南京黄金道珠宝店持农业银行卡购买黄金饰品刷卡消费人民币45.41万元，套取现金人民币18000元。后又持中国农业银行卡和工商银行卡分别取现人民币18000元、15000元。 公诉人就起诉书指控的犯罪事实当庭讯问了被告人，并列举了相关证据。据此，公诉机关认为，被告人尤仁健的行为已触犯《中华人民共和国刑法》第二百六十四条、第一百九十六条第三款、第一百九十六条第一款第（三）项之规定，应当以盗窃罪、信用卡诈骗罪追究其刑事责任。 被告人尤仁健对起诉书指控的事实均无异议。 尤仁健的辩护人辩称，杜某的两张卡都是其自己交给被告人尤仁健的，密码也是杜某告诉尤仁健的，被告人当庭对犯罪事实供认不讳，要求对被告人尤仁健酌情从轻处罚。 经审理查明： （一）2013年8月，经王某介绍，被告人尤仁健化名“曹振山”，认识了在温州市新南亚ktv工作的被害人蒋某，并自称是做大理石生意的，虚构家庭背景，骗取被害人蒋某的信任。2013年8月29日8时至9时30分许，被告人尤仁健在温州市上村路13幢308室被害人蒋某的住处窃取蒋某卡号为62×××77（补办的新卡卡号为62×××75）的中国农业银行卡一张，并于当日上午在浙江金万年珠宝有限公司第一分公司温州解放街店购买黄金饰品刷卡消费人民币（以下币种同）213213元，在温州市尚晨珠宝有限公司购买黄金饰品刷卡消费3900元，在温州市鹿城区五马街中国工商银行atm机提取现金18000元。 证明本节事实的证据有： 1．被害人蒋某的陈述，证实其与尤仁健认识的经过，以及尤仁健化名“曹振山”与其交往的过程；2013年8月29日，被告人尤仁健在温州市上村路13幢308室偷走其银行卡并刷卡消费217113元、取现18000元的事实。 辨认笔录及照片，证实经蒋某对一组12张男性正面免冠照片进行辨认后，确认4号照片上的人就是化名“曹振山”偷走其银行卡并将卡里钱取光的男子尤仁健。 2．证人赵某的证言，证实蒋某几个月前认识一个叫“曹振山”的男朋友，两人住在蒋某的住处，其与“曹振山”见过一面。今年8月底，“曹振山”拿走了蒋某的银行卡并于当日用蒋的银行卡刷卡买了20多万元的黄金，蒋某至今找不到“曹振山”。 辨认笔录及照片，证实经赵某对一组12张男性正面免冠照片进行辨认后，确认6号照片上的人就是其见过一面的“曹振山”（尤仁健）。 3．证人王某的证言，证实系其介绍自称“曹衬衫”的男子给新南亚ktv的蒋某认识，后来蒋某打电话给其说银行卡被“曹衬衫”偷走，里面的二十几万元也被“曹衬衫”取光的事实。 辨认笔录及照片，证实经王某对一组12张男性正面免冠照片进行辨认后，确认7号照片上的人就是自称“曹衬衫”（尤仁健）的客人。 4．证人陈某甲的证言，证实2013年8月29日上午9点多，有位男性顾客来金万年珠宝店，称朋友结婚，要买黄金首饰送朋友，他当时选购了数条项链、手链及金条等黄金饰品，共计金额213213元，该男子是拿出一张农业银行卡进行刷卡消费的，那个男子大概二十几岁的样子，讲普通话，上身穿短袖衬衫，下身穿牛仔裤。 辨认笔录及照片，证实经陈某甲对一组12张男性正面免冠照片进行辨认后，确认9号照片上的人就是8月29日来店消费购买了价值二十余万元的黄金首饰的男子尤仁健。 5．证人蔡某的证言，证实2013年8月29日上午，有位三十来岁的男子来尚晨珠宝店购买了一款价格为4150元的千足金手镯，用银行卡刷了3900元，现金付了250元。 辨认笔录及照片，证实经蔡某对一组12张男性正面免冠照片进行辨认后，确认2号照片上的人就是8月29日来尚晨珠宝店购买金饰的男子尤仁健。 6．银行回单复印件、质保单，证实客户签名为曹振山的男子于2013年8月29日在金万年珠宝店购买货物有千足金手链、千足金项链、千足金金条、千足金手镯、千足金吊坠等货品，总计金额为213213元；在尚晨珠宝店购买价格为4150元的千足金手镯，其中3900元系刷卡支付的事实。 7．蒋某手机屏拍照片三张，证实蒋某尾号为3977的农业银行卡在2013年8月29日的消费情况。 8．蒋某卡号为62×××75的中国农业银行账户交易明细，证实该卡在2013年8月29日分别刷卡消费213213元、3900元；提取现金6笔，每笔3000元，共计18000元的事实。 9．温州市尚晨珠宝店监控录像、金万年珠宝店监控录像，证实蒋某卡号为62×××77的中国农业银行在尚晨珠宝店、金万年珠宝店的刷卡消费均系尤仁健所为。 10．温公鹿刑勘（2013）080285号现场勘验检查笔录，证实通过现场勘查，公安人员在蒋某的住所提取了垃圾桶内的烟蒂3枚。 11．提取笔录，证实2014年2月12日17时许，公安人员在鹿城区看守所提取了被告人尤仁健的指血一份，用于dna同一比对。 12．温州市公安司法鉴定中心温公物鉴（2014）1076号法医物证鉴定书，证实在蒋某房间里提取的烟蒂三枚，经提取烟蒂上的dna与尤仁健的dna进行比对后，烟蒂上的dna系被告人尤仁健所留。 13．被告人尤仁健的当庭供述，供认上述事实，与以上证据能相互印证。 （二）2013年10月底，被告人尤仁健在浙江省杭州市东方魅力娱乐城结识被害人杜某。尤仁健化名“曹振山”并自称是做大理石生意的，虚构家庭背景，骗取被害人杜某的信任。2013年11月10日晚，尤仁健以请客户吃饭身边现金不够等为借口，骗得被害人杜某卡号为62×××71的中国银行卡一张，并持该卡消费取现共计人民币59026元。后又返回被害人杜某位于浙江省杭州市下城区仙林苑18幢3单元302室的住处，窃取现金人民币33500元及卡号为62×××09（补办的新卡卡号为60×××41）的中国邮政储蓄卡一张，后持该卡消费共计208284元。 证明本节事实的证据有： 1．被害人杜某的陈述，证实其与“曹振山”的认识经过，以及2013年11月10日被骗取中国银行卡并被刷卡消费59026元和被窃取中国邮政储蓄卡并被盗刷208284元，另外被盗现金33500元、港币1000元的事实。 辨认笔录及照片，证实经杜某对一组12张男性正面免冠照片进行辨认后，确认7号照片上的人就是自称“曹振山”，盗取其银行卡、现金等物的男子尤仁健。 2．杜某卡号为62×××09的中国邮政储蓄卡交易明细清单，证实该卡于2013年11月10日在浙江玖瑞玖商贸公司和中国黄金销售网点分别消费金额5500元、182784元；在浦东发展银行取现分别为六笔3000元、一笔2000元，总计取现金额2万元的事实。 3．杜某卡号为62×××71的中国银行卡帐户交易明细，证实该卡于2013年11月10日在杭州浦东发展银行取现七笔，共计17700元的事实。 4．杜某开户行为中国银行杭州仙林桥支行、帐号为00×××08的存款历史交易明细清单，证实该账户分别于2013年11月10日、11月11日消费37400元、3926元；11月11日共取现七笔，共计17700元的事实。 5．西湖浦发银行取款监控录像，证实杜某卡号为62×××71的中国银行卡在西湖浦发银行取款系尤仁健所为。 6．被告人尤仁健的当庭供述，供认上述事实，与以上证据能相互印证。 （三）2013年11-12月间，被告人尤仁健窜至江苏省南京市，结识了被害人陈某乙。尤仁健化名“曹振山”，并自称是做大理石生意的，虚构家庭背景，以结婚为名，骗得被害人陈某乙及其家人的某2014年1月3日，尤仁健在江苏省南京市鼓楼区中商万豪4724室窃取被害人陈某乙卡号为62×××72（补办的新卡卡号为62×××17）的中国农业银行卡和卡号为62×××34的中国工商银行卡各一张。后在胡某经营的南京黄金道珠宝店持中国农业银行卡购买黄金饰品刷卡消费人民币454100元，套取现金人民币18000元。又持中国农业银行卡和中国工商银行卡分别取现人民币18000元、15000元。 证明本节事实的证据有： 1．被害人陈某乙的陈述，证实其和化名“曹振山”的男子认识的经过、交往的过程，以及该名男子到其江苏省启东市的家中，以结婚为名，骗取其和其父母信任，后于2014年1月4日偷走其两张银行卡并刷卡消费、套现、取现共计51万余元的事实。 辨认笔录及照片，证实经陈某乙对一组12张男性正面免冠照片进行辨认后，确认7号照片上的人就是化名“曹振山”，偷走其银行卡并用其银行卡共消费、取现51万余元的男子尤仁健。 2．证人胡某的证言，证实2014年1月3日，一名男子向其联系购买两根金条的经过，所购买的两根金条价格为454100元，该名男子用一张农业银行卡刷卡消费，另外还在其店里刷卡套现18000元，其出售黄金有一张票据，那名男子还签了“振山”的名，刷卡的票据已经不在了。 辨认笔录及照片，证实经胡某对一组12张男性正面免冠照片进行辨认后，确认8号照片上的人就是2014年1月3日在其店里购买了45万余元黄金的男子尤仁健。 3．南京黄金通珠宝保证单，胡某手机短信照片，证实客户名称为“振山”的珠宝保证单上金额共计454100元，以及胡某的手机和185××××2877的手机号码进行短信联络的内容。 4．陈某乙账户为62×××17的中国农业银行交易明细对帐单，证实2014年1月3日该卡在atm机上累计取现18000元、电话转账472100元的事实。 5．陈某乙卡号为62×××34的中国工商银行账户历史明细清单，证实2014年1月3日该卡取现15000元的事实。 6．被告人尤仁健的当庭供述，供认上述事实，与以上证据能相互印证。 证明本案事实的其他证据还有： 1．上海市公安局东新路派出所出具的工作情况说明，证实被告人尤仁健系被抓获归案。 2．福州市鼓楼区人民法院（2007）鼓刑初字第610号刑事判决书、释放证明书，证实被告人尤仁健的前科情况。 3．户籍证明，证实尤仁健的身份情况。 以上证据经当庭举证、质证，证据合法、有效，且能相互印证，足以证明本案事实，本院予以确认。 关于杜某交给被告人尤仁健银行卡的张数问题。经查认为，被害人杜某的陈述证实，其所持有的邮政储蓄卡和中国银行卡分别是被告人尤仁健从其处窃取和骗取的，被告人尤仁健当庭也供述杜某仅给其一张银行卡，另一张是其窃取的，与杜某的陈述能相互印证，辩护人关于杜某的两张卡都是其自己交给被告人尤仁健的辩护意见与查明的事实不符，不予采纳。 ',
    裁判分析过程:
      '本院认为，被告人尤仁健以非法占有为目的，秘密窃取他人财物、盗窃他人信用卡并使用，数额特别巨大，其行为已构成盗窃罪；又冒用他人信用卡，数额巨大，其行为又构成信用卡诈骗罪。对被告人尤仁健应数罪并罚。公诉机关指控的罪名成立。被告人尤仁健曾因犯罪被判处有期徒刑以上刑罚，在刑罚执行完毕后五年内再犯应当判处有期徒刑以上刑罚之罪，系累犯，应当从重处罚。根据被告人尤仁健犯罪的事实、性质、情节和对于社会的危害程度，依照《中华人民共和国刑法》第一百九十六条第三款、第二百六十四条、第一百九十六条第一款第（三）项、第六十五条第一款、第六十四条之规定，判决如下：',
    判决结果:
      ' 一、被告人尤仁健犯盗窃罪，判处有期徒刑十五年，并处罚金人民币50万元；犯信用卡诈骗罪，判处有期徒刑六年，并处罚金人民币6万元，决定执行有期徒刑二十年，并处罚金人民币56万元。 （刑期从判决执行之日起计算。判决执行以前先行羁押的，羁押一日折抵刑期一日，即自2014年2月9日起至2034年2月8日止。罚金限于本判决生效之日起一个月内缴纳）。 二、责令被告人尤仁健退赔违法所得返还各被害人。 如不服本判决，可在接到判决书的第二日起十日内，通过本院或者直接向浙江省高级人民法院提出上诉。书面上诉的，应当提交上诉状正本一份，副本二份。',
    文尾: ' 审判长朱若荪 代理审判员方彬微 人民陪审员池万春 二〇一四年九月十五日 书记员蒋罕 ',
    文书是否模糊: '否',
  },
  附加段: '是',
  自定义_裁判文书_裁判分析过程:
    '关于杜某交给被告人尤仁健银行卡的张数问题。经查认为，被害人杜某的陈述证实，其所持有的邮政储蓄卡和中国银行卡分别是被告人尤仁健从其处窃取和骗取的，被告人尤仁健当庭也供述杜某仅给其一张银行卡，另一张是其窃取的，与杜某的陈述能相互印证，辩护人关于杜某的两张卡都是其自己交给被告人尤仁健的辩护意见与查明的事实不符，不予采纳。 本院认为，被告人尤仁健以非法占有为目的，秘密窃取他人财物、盗窃他人信用卡并使用，数额特别巨大，其行为已构成盗窃罪；又冒用他人信用卡，数额巨大，其行为又构成信用卡诈骗罪。对被告人尤仁健应数罪并罚。公诉机关指控的罪名成立。被告人尤仁健曾因犯罪被判处有期徒刑以上刑罚，在刑罚执行完毕后五年内再犯应当判处有期徒刑以上刑罚之罪，系累犯，应当从重处罚。根据被告人尤仁健犯罪的事实、性质、情节和对于社会的危害程度，依照《中华人民共和国刑法》第一百九十六条第三款、第二百六十四条、第一百九十六条第一款第（三）项、第六十五条第一款、第六十四条之规定，判决如下：',
  自定义_裁判文书_认定事实:
    '经审理查明： （一）2013年8月，经王某介绍，被告人尤仁健化名“曹振山”，认识了在温州市新南亚ktv工作的被害人蒋某，并自称是做大理石生意的，虚构家庭背景，骗取被害人蒋某的信任。2013年8月29日8时至9时30分许，被告人尤仁健在温州市上村路13幢308室被害人蒋某的住处窃取蒋某卡号为62×××77（补办的新卡卡号为62×××75）的中国农业银行卡一张，并于当日上午在浙江金万年珠宝有限公司第一分公司温州解放街店购买黄金饰品刷卡消费人民币（以下币种同）213213元，在温州市尚晨珠宝有限公司购买黄金饰品刷卡消费3900元，在温州市鹿城区五马街中国工商银行atm机提取现金18000元。  （二）2013年10月底，被告人尤仁健在浙江省杭州市东方魅力娱乐城结识被害人杜某。尤仁健化名“曹振山”并自称是做大理石生意的，虚构家庭背景，骗取被害人杜某的信任。2013年11月10日晚，尤仁健以请客户吃饭身边现金不够等为借口，骗得被害人杜某卡号为62×××71的中国银行卡一张，并持该卡消费取现共计人民币59026元。后又返回被害人杜某位于浙江省杭州市下城区仙林苑18幢3单元302室的住处，窃取现金人民币33500元及卡号为62×××09（补办的新卡卡号为60×××41）的中国邮政储蓄卡一张，后持该卡消费共计208284元。 ',
  自定义_裁判文书_指控段落:
    ' 温州市人民检察院指控，2013年8月，被告人尤仁健，通过王某介绍，认识了在温州市新南亚ktv工作的被害人蒋某，被告人尤仁健化名曹振山，虚构家庭背景，以为被害人蒋某买车为幌子，骗得了被害人蒋某的信任。2013年8月29日8时至9时30分许，被告人尤仁健在温州市上村路13幢308室被害人蒋某的住处盗得蒋62×××75的中国农业银行卡一张，并于当日上午在浙江金万年珠宝有限公司第一分公司温州解放街店购买黄金饰品刷卡消费人民币213213元，在温州市尚晨珠宝有限公司购买黄金饰品刷卡消费人民币3900元，在温州市鹿城区五马街中国工商银行atm机提取人民币18000元。 2013年10月底，被告人尤仁健在浙江省杭州市东方魅力娱乐城结识被害人杜某。被告人尤仁健化名曹振山，虚构家庭背景，以为被害人杜某买车为幌子，骗得了被害人杜某的信任。2013年11月10日晚，被告人尤仁健以没钱请客户吃饭等为借口，骗得被害人杜某的卡号为62×××71的中国银行卡一张，持该卡消费取现共计人民币59026元。后又返回被害人杜某位于浙江省杭州市下城区仙林苑18幢3单元302室的住处，盗取现金人民币33500元及卡号为60×××41的中国邮政储蓄卡一张，又持该卡消费取现共计人民币208284元。 2013年11-12月间，被告人尤仁健窜至江苏省南京市，结识被害人陈某乙。2014年1月3日，被告人尤仁健在江苏省南京市鼓楼区中商万豪4724室盗得受害人陈某乙卡号为62×××17的中国农业银行卡一张和卡号为62×××34的工商银行卡一张，后在胡某经营的南京黄金道珠宝店持农业银行卡购买黄金饰品刷卡消费人民币45.41万元，套取现金人民币18000元。后又持中国农业银行卡和工商银行卡分别取现人民币18000元、15000元。 公诉人就起诉书指控的犯罪事实当庭讯问了被告人，并列举了相关证据。据此，公诉机关认为，被告人尤仁健的行为已触犯《中华人民共和国刑法》第二百六十四条、第一百九十六条第三款、第一百九十六条第一款第（三）项之规定，应当以盗窃罪、信用卡诈骗罪追究其刑事责任。',
  自定义_裁判文书_当事人:
    '公诉机关浙江省温州市人民检察院。 被告人尤仁健。曾因犯盗窃罪、诈骗罪于2003年11月被判处有期徒刑三年；又因犯诈骗罪于2008年1月2日被判处有期徒刑七年，2013年1月4日刑满释放。现因涉嫌犯盗窃罪于2014年2月9日被刑事拘留，2014年3月18日被逮捕。现羁押于温州市鹿城区看守所。 指定辩护人张奕。',
  自定义_裁判文书_辩护段落:
    '被告人尤仁健对起诉书指控的事实均无异议。 尤仁健的辩护人辩称，杜某的两张卡都是其自己交给被告人尤仁健的，密码也是杜某告诉尤仁健的，被告人当庭对犯罪事实供认不讳，要求对被告人尤仁健酌情从轻处罚。 ',
  辩护意见图谱: '辩护意见图谱',
  法条: [
    '《中华人民共和国刑法》第二百六十四条',
    '《中华人民共和国刑事诉讼法》第二百二十五条第一款第（一）项',
    '《中华人民共和国刑法》第一百九十六条第三款',
    '《中华人民共和国刑法》第六十五条第一款',
    '《中华人民共和国刑法》第六十四条',
    '《中华人民共和国刑法》第六十九条',
    '《中华人民共和国刑法》第一百九十六条第一款第（三）项',
  ],
};
</script>

<template>
  <div class="main flex flex-column">
    <Toast />
    <HeaderBar />
    <div class="body">
      <div class="content">
        <h1 style="text-align: center">
          {{
            ('经办法院' in casea.全文.文首
              ? casea.全文.文首.经办法院
              : casea.全文.文首.承办机关) +
            ' ' +
            casea.全文.文首.文书名称
          }}
        </h1>
        <h2 style="text-align: center">{{ casea.全文.文首.案号 }}</h2>
        <div class="文首">
          <div class="item" v-for="(value, key) in casea.全文.文首" :key="key">
            <b>{{ key }}： </b> {{ value }}
          </div>
        </div>
        <template v-for="(value, key) in casea.全文" :key="key">
          <div v-if="(key as unknown as string) != '文首'">
            <h3>{{ key }}</h3>
            {{ value }}
          </div>
        </template>
        <div class="additional">
          <template v-for="(value, key) in casea" :key="key">
            <div v-if="(key as unknown as string).startsWith('自定义')">
              <h3>
                {{ (key as unknown as string).split('_')[(key as unknown as string).split('_').length - 1] }}
              </h3>
              {{ value }}
            </div>
          </template>
        </div>
      </div>
      <div class="sidebar"></div>
    </div>
  </div>
</template>

<style scoped lang="scss">
:deep(.searchbar) {
  width: 65vh;
}

.body {
  display: grid;
  grid-template-columns: 3fr 1fr;
}
.content {
  padding: 1rem 2rem;
  margin: 0rem 1rem;
  color: var(--text-color);
  line-height: 2;
}

.文首 {
  display: grid;
  grid-template-columns: 1fr 1fr;
  background-color: #fafafa;
  border-radius: 10px;
  padding: 1rem;
  .item {
    padding: 0.1rem;
  }
}

.additional {
  padding: 0.3rem 1rem 1rem 1.5rem;
  margin-top: 2rem;
  border-radius: 10px;
  background-color: #fafafa;
  border-color: #71aaff;
  border-width: 0 0 0 5px;
  border-style: solid;
}
</style>
